# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.2  # model depth multiple
width_multiple: 0.2    # layer channel multiple
anchors:
  - [8,8]  # P3/8
  - [16,16]  # P4/16
  - [32,32]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Silence, []],             # 0
   [-1, 1, Conv,   [64, 6, 2, 2]],   # 1
   [-1, 1, Conv,   [128, 3, 2]],     # 2
   [-1, 3, C3  ,   [128,True]],      # 3

   [-1, 1, Conv, [256, 3, 2]],  # 4
   [-1, 6, C3,    [256,True]],  # 5

   [-1, 1, Conv, [512, 3, 2]],  # 6
   [-1, 6, C3,    [512,True]],  # 7

   [-1, 1, Conv, [512, 3, 2]],  # 8
   [-1, 3, C3,    [512,True]],  # 9

   [-1, 1, SPPF,   [512, 5]],   # 10 
  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, Conv, [512, 1, 1]],  # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 12
   [[-1, 7], 1, Concat, [1]],   # 13
   [-1, 3, C3, [512, False]],   # 14
   
   [-1, 1, Conv, [256, 1, 1]],  # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 16
   [[-1, 5], 1, Concat, [1]],   # 17
   [-1, 3, C3, [256, False]],   # 18

   [-1, 1, Conv, [256, 3, 2]],  # 19
   [[-1, 15], 1, Concat, [1]],  # 20
   [-1, 3, C3, [512, False]],   # 21

   [-1, 1, Conv, [512, 3, 2]],  # 22
   [[-1, 11], 1, Concat, [1]],   # 23
   [-1, 3, C3, [512, False]],   # 24


   [4, 1, CBLinear, [[256]]],           # 25
   [6, 1, CBLinear, [[256, 512]]],      # 26
   [8, 1, CBLinear, [[256, 512, 512]]], # 27
  
   [0, 1,  Conv, [64, 3, 2]],    # 28-P1/2
   [-1, 1, Conv, [128, 3, 2]],   # 29-P2/4 
   [-1, 1, C3, [128, True]],     # 30  

   [-1, 1, Conv, [256, 3, 2]],   # 31-P3/8 
   [[23, 24, 25, -1], 1, CBFuse, [[0, 0, 0]]], # 32  
   [-1, 1, C3, [256, True]],     # 33  

   [-1, 1, Conv, [512, 3, 2]],   # 34
   [[24, 25, -1], 1, CBFuse, [[1, 1]]],  # 35
   [-1, 1, C3, [512, True]],     # 36

   [-1, 1, Conv, [512, 3, 2]],   # 37
   [[25, -1], 1, CBFuse, [[2]]], # 38
   [-1, 1, C3, [512, True]],     # 39

   [[33, 36, 39, 18, 21, 24], 1, Detect, [nc, anchors]], 
  ]
