# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.2  # model depth multiple
width_multiple: 0.2    # layer channel multiple
anchors:
  - [8,8]  # P3/8
  - [16,16]  # P4/16
  - [32,32]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Silence, []],          # 0
   [-1, 1, Conv, [64, 6, 2, 2]],  # 1
   [-1, 1, Conv, [128, 3, 2]],    # 2
   [-1, 3, C3, [128,True,False]], # 3
   [-1, 1, DWConv, [256, 3, 2]],  # 4
   [-1, 6, C2f, [256,True]],      # 5
   [-1, 1, DWConv, [512, 3, 2]],  # 6
   [-1, 9, C2f, [512,True]],      # 7
   [-1, 1, DWConv, [1024, 3, 2]], # 8
   [-1, 3, C2f, [1024,True]],     # 9
   [-1, 1, SPPF, [1024, 5]],      # 10
  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [[-1, 6], 1, Concat, [1]],                  # 12
   [-1, 3, C3, [512, False]],                  # 13

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 14
   [[-1, 4], 1, Concat, [1]],                  # 15
   [-1, 3, C2f, [256, False]],                 # 16
 
   [-1, 1, DWConv, [256, 3, 2]],               # 17
   [[-1, 12], 1, Concat, [1]],                 # 18
   [-1, 3, C2f, [512, False]],                 # 19
 
   [-1, 1, DWConv, [512, 3, 2]],               # 20
   [[-1, 9], 1, Concat, [1]],                  # 21
   [-1, 3, C2f, [1024, False]],                # 22

   # AUX
   [4, 1, CBLinear, [[256]]],                  # 23
   [6, 1, CBLinear, [[256, 512]]],             # 24
   [8, 1, CBLinear, [[256, 512, 512]]],        # 25
  
   [ 0, 1, Conv, [64, 3, 2]],                  # 26
   [-1, 1, Conv, [128, 3, 2]],                 # 27
   [-1, 1, C2f, [128, True]],                  # 28
   [-1, 1, Conv, [256, 3, 2]],                 # 29
   [[23, 24, 25, -1], 1, CBFuse, [[0, 0, 0]]], # 30  
   [-1, 1, C2f, [256, True]],                  # 31

   [-1, 1, Conv, [512, 3, 2]],                 # 32
   [[24, 25, -1], 1, CBFuse, [[1, 1]]],        # 33 
   [-1, 1, C2f, [512, True]],                  # 34

   [-1, 1, Conv, [512, 3, 2]],                 # 35
   [[25, -1], 1, CBFuse, [[2]]],               # 36
   [-1, 1, C2f, [512, True]],                  # 37

   [[31, 34, 37, 16, 19, 22], 1, Detect, [nc, anchors]],  #  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
