# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.2  # model depth multiple
width_multiple: 0.2    # layer channel multiple
anchors:
  - [8,8]  # P3/8
  - [16,16]  # P4/16
  - [32,32]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv,   [64, 6, 2, 2]],  # 0
   [-1, 1, Conv,   [128, 3, 2]],    # 1
   [-1, 3, C3  ,   [128,True]],     # 2

   [-1, 1, Conv, [256, 3, 2]],      # 3
   [-1, 6, C3,    [256,True]],      # 4

   [-1, 1, Conv, [512, 3, 2]],      # 5
   [-1, 9, C3,    [512,True]],      # 6

   [-1, 1, Conv, [512, 3, 2]],      # 7
   [-1, 3, C3,    [512,True]],      # 8

   [-1, 1, SPPF,   [512, 5]],       # 9
  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, Conv, [512, 1, 1]], # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # 12
   [-1, 3, C3, [512, False]],  # 13
   
   [-1, 1, Conv, [256, 1, 1]], # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # 16
   [-1, 3, C3, [256, False]],  # 17 

   [-1, 1, Conv, [256, 3, 2]], # 18
   [[-1, 14], 1, Concat, [1]], # 19
   [-1, 3, C3, [512, False]],  # 20 

   [-1, 1, Conv, [512, 3, 2]], # 21
   [[-1, 10], 1, Concat, [1]], # 22
   [-1, 3, C3, [512, False]],  # 23 

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
